TODO.org
#+STARTUP: indent
* Completed Tasks [40/40]
** Any priority
*** DONE 
Switch from "consumes char" to "consumes", and same for "produces" and other types.
*** DONE 
Get the function name to be above the function arguments.
*** DONE 
Re-order blocks to match likely use.
*** DONE 
Put 'and' and 'or' in 'booleans'.
*** DONE 
Make function names black
*** DONE 
Switch '*' for '×'
*** DONE 
Refactor to have consistent naming conventions!!!
*** DONE 
Fix bug where disposing an expression with sub-expressions throws an error during typechecking
*** DONE 
Remove dependency on underscore.js 
*** DONE 
When dragging blocks with rest arguments, the rest arguments revert to unknown color, they're fine if I add or remove arguments, but initially they do have this problem.
*** DONE 
Show the function signature inside the canvas as well, so that you can drag arguments from the signature into the function body.
*** DONE 
Add blocks for test cases 
*** DONE 
Get rid of 'all' drawer
*** DONE 
Add interface element to halt computation
*** DONE 
Fixed bug where char would throw error
*** DONE 
Fixed bug where opening/closing signature Would cause text highlight
*** DONE 
Make it possible to rename function arguments.
*** DONE 
Make it possible to edit function signature, remove a function.
*** DONE 
Figure out how to get the workspace to fit in the available space exactly.
*** DONE 
Main vertical scrollbar is broken.
*** DONE 
Fix weird rendering issue with statement blocks.
*** DONE 
For definitions with holes, have a hole icon on the tab for that definition to indicate that the definition is unfinished.
*** DONE 
Update signature language to read more like natural language
*** DONE 
X to remove argument
*** DONE 
Fix list block, so that it typechecks correctly (basically, I just have to special case this in the typechecker, and provide the appropriate constraints).
*** DONE 
Add tooltips to funTab icon buttons
*** DONE 
Have tabs change color on test success/failure (don't correctly handle unfinished definitions or tests)
*** DONE 
Have test blocks change color on test success/failure
