todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO</title>
<!-- 2013-10-27 Sun 15:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Spencer Gordon"/>
</head>
<body>
<div id="content">
<h1 class="title">TODO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Completed Tasks <code>[40/40]</code></a>
<ul>
<li><a href="#sec-1-1">1.1. Any priority</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. </a></li>
<li><a href="#sec-1-1-2">1.1.2. </a></li>
<li><a href="#sec-1-1-3">1.1.3. </a></li>
<li><a href="#sec-1-1-4">1.1.4. </a></li>
<li><a href="#sec-1-1-5">1.1.5. </a></li>
<li><a href="#sec-1-1-6">1.1.6. </a></li>
<li><a href="#sec-1-1-7">1.1.7. </a></li>
<li><a href="#sec-1-1-8">1.1.8. </a></li>
<li><a href="#sec-1-1-9">1.1.9. </a></li>
<li><a href="#sec-1-1-10">1.1.10. </a></li>
<li><a href="#sec-1-1-11">1.1.11. </a></li>
<li><a href="#sec-1-1-12">1.1.12. </a></li>
<li><a href="#sec-1-1-13">1.1.13. </a></li>
<li><a href="#sec-1-1-14">1.1.14. </a></li>
<li><a href="#sec-1-1-15">1.1.15. </a></li>
<li><a href="#sec-1-1-16">1.1.16. </a></li>
<li><a href="#sec-1-1-17">1.1.17. </a></li>
<li><a href="#sec-1-1-18">1.1.18. </a></li>
<li><a href="#sec-1-1-19">1.1.19. </a></li>
<li><a href="#sec-1-1-20">1.1.20. </a></li>
<li><a href="#sec-1-1-21">1.1.21. </a></li>
<li><a href="#sec-1-1-22">1.1.22. </a></li>
<li><a href="#sec-1-1-23">1.1.23. </a></li>
<li><a href="#sec-1-1-24">1.1.24. </a></li>
<li><a href="#sec-1-1-25">1.1.25. </a></li>
<li><a href="#sec-1-1-26">1.1.26. </a></li>
<li><a href="#sec-1-1-27">1.1.27. </a></li>
<li><a href="#sec-1-1-28">1.1.28. </a></li>
<li><a href="#sec-1-1-29">1.1.29. </a></li>
<li><a href="#sec-1-1-30">1.1.30. </a></li>
<li><a href="#sec-1-1-31">1.1.31. </a></li>
<li><a href="#sec-1-1-32">1.1.32. </a></li>
<li><a href="#sec-1-1-33">1.1.33. </a></li>
<li><a href="#sec-1-1-34">1.1.34. </a></li>
<li><a href="#sec-1-1-35">1.1.35. </a></li>
<li><a href="#sec-1-1-36">1.1.36. </a></li>
<li><a href="#sec-1-1-37">1.1.37. </a></li>
<li><a href="#sec-1-1-38">1.1.38. </a></li>
<li><a href="#sec-1-1-39">1.1.39. </a></li>
<li><a href="#sec-1-1-40">1.1.40. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Remaining Tasks</a>
<ul>
<li><a href="#sec-2-1">2.1. High Priority <code>[0/18]</code></a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. </a></li>
<li><a href="#sec-2-1-2">2.1.2. </a></li>
<li><a href="#sec-2-1-3">2.1.3. </a></li>
<li><a href="#sec-2-1-4">2.1.4. </a></li>
<li><a href="#sec-2-1-5">2.1.5. </a></li>
<li><a href="#sec-2-1-6">2.1.6. </a></li>
<li><a href="#sec-2-1-7">2.1.7. </a></li>
<li><a href="#sec-2-1-8">2.1.8. </a></li>
<li><a href="#sec-2-1-9">2.1.9. </a></li>
<li><a href="#sec-2-1-10">2.1.10. </a></li>
<li><a href="#sec-2-1-11">2.1.11. </a></li>
<li><a href="#sec-2-1-12">2.1.12. </a></li>
<li><a href="#sec-2-1-13">2.1.13. </a></li>
<li><a href="#sec-2-1-14">2.1.14. </a></li>
<li><a href="#sec-2-1-15">2.1.15. </a></li>
<li><a href="#sec-2-1-16">2.1.16. </a></li>
<li><a href="#sec-2-1-17">2.1.17. </a></li>
<li><a href="#sec-2-1-18">2.1.18. </a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Low Priority <code>[0/38]</code></a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. </a></li>
<li><a href="#sec-2-2-2">2.2.2. </a></li>
<li><a href="#sec-2-2-3">2.2.3. </a></li>
<li><a href="#sec-2-2-4">2.2.4. </a></li>
<li><a href="#sec-2-2-5">2.2.5. </a></li>
<li><a href="#sec-2-2-6">2.2.6. </a></li>
<li><a href="#sec-2-2-7">2.2.7. </a></li>
<li><a href="#sec-2-2-8">2.2.8. </a></li>
<li><a href="#sec-2-2-9">2.2.9. </a></li>
<li><a href="#sec-2-2-10">2.2.10. </a></li>
<li><a href="#sec-2-2-11">2.2.11. </a></li>
<li><a href="#sec-2-2-12">2.2.12. </a></li>
<li><a href="#sec-2-2-13">2.2.13. </a></li>
<li><a href="#sec-2-2-14">2.2.14. </a></li>
<li><a href="#sec-2-2-15">2.2.15. </a></li>
<li><a href="#sec-2-2-16">2.2.16. </a></li>
<li><a href="#sec-2-2-17">2.2.17. </a></li>
<li><a href="#sec-2-2-18">2.2.18. </a></li>
<li><a href="#sec-2-2-19">2.2.19. </a></li>
<li><a href="#sec-2-2-20">2.2.20. </a></li>
<li><a href="#sec-2-2-21">2.2.21. </a></li>
<li><a href="#sec-2-2-22">2.2.22. </a></li>
<li><a href="#sec-2-2-23">2.2.23. </a></li>
<li><a href="#sec-2-2-24">2.2.24. </a></li>
<li><a href="#sec-2-2-25">2.2.25. </a></li>
<li><a href="#sec-2-2-26">2.2.26. </a></li>
<li><a href="#sec-2-2-27">2.2.27. </a></li>
<li><a href="#sec-2-2-28">2.2.28. </a></li>
<li><a href="#sec-2-2-29">2.2.29. </a></li>
<li><a href="#sec-2-2-30">2.2.30. </a></li>
<li><a href="#sec-2-2-31">2.2.31. </a></li>
<li><a href="#sec-2-2-32">2.2.32. </a></li>
<li><a href="#sec-2-2-33">2.2.33. </a></li>
<li><a href="#sec-2-2-34">2.2.34. </a></li>
<li><a href="#sec-2-2-35">2.2.35. </a></li>
<li><a href="#sec-2-2-36">2.2.36. </a></li>
<li><a href="#sec-2-2-37">2.2.37. </a></li>
<li><a href="#sec-2-2-38">2.2.38. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Completed Tasks <code>[40/40]</code></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Any priority</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Switch from "consumes char" to "consumes", and same for "produces" and other types.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Get the function name to be above the function arguments.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Re-order blocks to match likely use.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Put 'and' and 'or' in 'booleans'.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Make function names black
</p>
</div>
</div>

<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
Switch '*' for '×'
</p>
</div>
</div>

<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
Refactor to have consistent naming conventions!!!
</p>
</div>
</div>

<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8"><span class="section-number-4">1.1.8</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Fix bug where disposing an expression with sub-expressions throws an error during typechecking
</p>
</div>
</div>

<div id="outline-container-sec-1-1-9" class="outline-4">
<h4 id="sec-1-1-9"><span class="section-number-4">1.1.9</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
Remove dependency on underscore.js 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-10" class="outline-4">
<h4 id="sec-1-1-10"><span class="section-number-4">1.1.10</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
When dragging blocks with rest arguments, the rest arguments revert to unknown color, they're fine if I add or remove arguments, but initially they do have this problem.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-11" class="outline-4">
<h4 id="sec-1-1-11"><span class="section-number-4">1.1.11</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-11">
<p>
Show the function signature inside the canvas as well, so that you can drag arguments from the signature into the function body.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-12" class="outline-4">
<h4 id="sec-1-1-12"><span class="section-number-4">1.1.12</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
Add blocks for test cases 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-13" class="outline-4">
<h4 id="sec-1-1-13"><span class="section-number-4">1.1.13</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
Get rid of 'all' drawer
</p>
</div>
</div>

<div id="outline-container-sec-1-1-14" class="outline-4">
<h4 id="sec-1-1-14"><span class="section-number-4">1.1.14</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-14">
<p>
Add interface element to halt computation
</p>
</div>
</div>

<div id="outline-container-sec-1-1-15" class="outline-4">
<h4 id="sec-1-1-15"><span class="section-number-4">1.1.15</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-15">
<p>
Fixed bug where char would throw error
</p>
</div>
</div>

<div id="outline-container-sec-1-1-16" class="outline-4">
<h4 id="sec-1-1-16"><span class="section-number-4">1.1.16</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-16">
<p>
Fixed bug where opening/closing signature Would cause text highlight
</p>
</div>
</div>

<div id="outline-container-sec-1-1-17" class="outline-4">
<h4 id="sec-1-1-17"><span class="section-number-4">1.1.17</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-17">
<p>
Make it possible to rename function arguments.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-18" class="outline-4">
<h4 id="sec-1-1-18"><span class="section-number-4">1.1.18</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-18">
<p>
Make it possible to edit function signature, remove a function.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-19" class="outline-4">
<h4 id="sec-1-1-19"><span class="section-number-4">1.1.19</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-19">
<p>
Figure out how to get the workspace to fit in the available space exactly.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-20" class="outline-4">
<h4 id="sec-1-1-20"><span class="section-number-4">1.1.20</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-20">
<p>
Main vertical scrollbar is broken.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-21" class="outline-4">
<h4 id="sec-1-1-21"><span class="section-number-4">1.1.21</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-21">
<p>
Fix weird rendering issue with statement blocks.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-22" class="outline-4">
<h4 id="sec-1-1-22"><span class="section-number-4">1.1.22</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-22">
<p>
For definitions with holes, have a hole icon on the tab for that definition to indicate that the definition is unfinished.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-23" class="outline-4">
<h4 id="sec-1-1-23"><span class="section-number-4">1.1.23</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-23">
<p>
Update signature language to read more like natural language
</p>
</div>
</div>

<div id="outline-container-sec-1-1-24" class="outline-4">
<h4 id="sec-1-1-24"><span class="section-number-4">1.1.24</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-24">
<p>
X to remove argument
</p>
</div>
</div>

<div id="outline-container-sec-1-1-25" class="outline-4">
<h4 id="sec-1-1-25"><span class="section-number-4">1.1.25</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-25">
<p>
Fix list block, so that it typechecks correctly (basically, I just have to special case this in the typechecker, and provide the appropriate constraints).
</p>
</div>
</div>

<div id="outline-container-sec-1-1-26" class="outline-4">
<h4 id="sec-1-1-26"><span class="section-number-4">1.1.26</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-26">
<p>
Add tooltips to funTab icon buttons
</p>
</div>
</div>

<div id="outline-container-sec-1-1-27" class="outline-4">
<h4 id="sec-1-1-27"><span class="section-number-4">1.1.27</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-27">
<p>
Have tabs change color on test success/failure (don't correctly handle unfinished definitions or tests)
</p>
</div>
</div>
