TODO.org
*** DONE 
Have test blocks reset color when subexpressions or function definition changes
*** DONE 
Have run button check all tests in main workspace, but just a function's tests when in that function's tab.
*** DONE 
Have run button disabled when viewing invalid workspace
*** DONE 
Have run button text and tooltip change appropriately 
*** DONE 
Use full name of types. num -> number, str -> string, char -> character. Make this easy and configurable, so I can change this globally
*** DONE 
Rename 'forms' to 'constructs' or 'control'
*** DONE 
Make function names unique
*** DONE 
Fixed bug in firefox caused by calling getBBox on hidden svg element
*** DONE 
Fixed race condition
*** DONE 
Fixed signature text translation bug
*** DONE 
Fixed hidden horizontal scroll bar on signature
*** DONE 
Make everything serializable, so I can easily load from some JS data structure. !! (or XML blob)

* Remaining Tasks
** High Priority [0/18]
*** TODO [#A] 
Double clicking is like using a repl, and is immediate evaluation, while running a program is the formal version which triggers tests to be run. (Even if you don't use something, all the tests should be run) I currently have the UI in place for double clicking, but haven't hooked it up to evaluation.
*** TODO [#A]
Have failed tests change color to red upon failure, and successful ones to turn green upon success, and then have a tooltip that explains what went wrong that is active over the whole area of the test block. Have a tab change color as well if there are failing tests in the tab. I have everything here but the tooltip on the test block with an explanation of what went wrong.
*** TODO [#A]
Have unfinished definitions work gracefully  
*** TODO [#B]
When you change a function and that causes type error, make the block that doesn't fit turn red or something, and then also have the workspaces which use that block turn red as well
*** TODO [#A]
Add in image atomic type. !!
*** TODO [#B]
Add support for world-programming, via big-bang primitives. !!
*** TODO [#A]
Test adding so many functions that the tab bar is longer than the screen width 
*** TODO [#A]
Get function body displayable in pop-up alongside function usage !!
*** TODO [#A]
Make it possible to define a value by right-clicking, saying "Name a value" (Not inside functions) !!
*** TODO [#C]
Hook up to WeScheme !! I have accounts working, and need to add the interface elements for listing programs. 
*** TODO [#A]
Make failed attempts to connect react more violently to that failure. Maybe have block to which you can't connect get repelled!
*** TODO [#A]
Make drop targets for blocks larger, so that it's easier to connect them.
*** TODO [#A]
Default type of argument should be blank.
*** TODO [#A]
Test it on iPad !!
*** TODO [#A]
Make signature easier to open when closed
*** TODO [#B]
Move example block to next line, and add the word "For" in front so it reads "For example..."
*** TODO [#C]
Pull latest version of Blockly
*** TODO [#A]
Provide support for undoing any action !!

** Low Priority [0/38]
*** TODO
Switch to rounded rectangles. Merge this with notch shape
*** TODO
Change unknown color to rainbow gradient.
*** TODO
Move the button to open function editing dialog to the signature
*** TODO
Make it possible to define a value by right-clicking, saying "Name a value" (Inside functions)
*** TODO
Every time there is a bug, set it up to send me an email.
*** TODO
Inside function definition dialog, you should be able to drag a name and type into the signature to add an argument.
