todo.html

<div id="outline-container-sec-1-1-28" class="outline-4">
<h4 id="sec-1-1-28"><span class="section-number-4">1.1.28</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-28">
<p>
Have test blocks change color on test success/failure
</p>
</div>
</div>

<div id="outline-container-sec-1-1-29" class="outline-4">
<h4 id="sec-1-1-29"><span class="section-number-4">1.1.29</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-29">
<p>
Have test blocks reset color when subexpressions or function definition changes
</p>
</div>
</div>

<div id="outline-container-sec-1-1-30" class="outline-4">
<h4 id="sec-1-1-30"><span class="section-number-4">1.1.30</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-30">
<p>
Have run button check all tests in main workspace, but just a function's tests when in that function's tab.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-31" class="outline-4">
<h4 id="sec-1-1-31"><span class="section-number-4">1.1.31</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-31">
<p>
Have run button disabled when viewing invalid workspace
</p>
</div>
</div>

<div id="outline-container-sec-1-1-32" class="outline-4">
<h4 id="sec-1-1-32"><span class="section-number-4">1.1.32</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-32">
<p>
Have run button text and tooltip change appropriately 
</p>
</div>
</div>

<div id="outline-container-sec-1-1-33" class="outline-4">
<h4 id="sec-1-1-33"><span class="section-number-4">1.1.33</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-33">
<p>
Use full name of types. num -&gt; number, str -&gt; string, char -&gt; character. Make this easy and configurable, so I can change this globally
</p>
</div>
</div>

<div id="outline-container-sec-1-1-34" class="outline-4">
<h4 id="sec-1-1-34"><span class="section-number-4">1.1.34</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-34">
<p>
Rename 'forms' to 'constructs' or 'control'
</p>
</div>
</div>

<div id="outline-container-sec-1-1-35" class="outline-4">
<h4 id="sec-1-1-35"><span class="section-number-4">1.1.35</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-35">
<p>
Make function names unique
</p>
</div>
</div>

<div id="outline-container-sec-1-1-36" class="outline-4">
<h4 id="sec-1-1-36"><span class="section-number-4">1.1.36</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-36">
<p>
Fixed bug in firefox caused by calling getBBox on hidden svg element
</p>
</div>
</div>

<div id="outline-container-sec-1-1-37" class="outline-4">
<h4 id="sec-1-1-37"><span class="section-number-4">1.1.37</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-37">
<p>
Fixed race condition
</p>
</div>
</div>

<div id="outline-container-sec-1-1-38" class="outline-4">
<h4 id="sec-1-1-38"><span class="section-number-4">1.1.38</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-38">
<p>
Fixed signature text translation bug
</p>
</div>
</div>

<div id="outline-container-sec-1-1-39" class="outline-4">
<h4 id="sec-1-1-39"><span class="section-number-4">1.1.39</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-39">
<p>
Fixed hidden horizontal scroll bar on signature
</p>
</div>
</div>

<div id="outline-container-sec-1-1-40" class="outline-4">
<h4 id="sec-1-1-40"><span class="section-number-4">1.1.40</span> <span class="done DONE">DONE</span> </h4>
<div class="outline-text-4" id="text-1-1-40">
<p>
Make everything serializable, so I can easily load from some JS data structure. !! (or XML blob)
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Remaining Tasks</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> High Priority <code>[0/18]</code></h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Double clicking is like using a repl, and is immediate evaluation, while running a program is the formal version which triggers tests to be run. (Even if you don't use something, all the tests should be run) I currently have the UI in place for double clicking, but haven't hooked it up to evaluation.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Have failed tests change color to red upon failure, and successful ones to turn green upon success, and then have a tooltip that explains what went wrong that is active over the whole area of the test block. Have a tab change color as well if there are failing tests in the tab. I have everything here but the tooltip on the test block with an explanation of what went wrong.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Have unfinished definitions work gracefully  
</p>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
When you change a function and that causes type error, make the block that doesn't fit turn red or something, and then also have the workspaces which use that block turn red as well
</p>
</div>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
Add in image atomic type. !!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Add support for world-programming, via big-bang primitives. !!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
Test adding so many functions that the tab bar is longer than the screen width 
</p>
</div>
</div>

<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
Get function body displayable in pop-up alongside function usage !!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-9" class="outline-4">
<h4 id="sec-2-1-9"><span class="section-number-4">2.1.9</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-9">
<p>
Make it possible to define a value by right-clicking, saying "Name a value" (Not inside functions) !!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-10" class="outline-4">
<h4 id="sec-2-1-10"><span class="section-number-4">2.1.10</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-10">
<p>
Hook up to WeScheme !! I have accounts working, and need to add the interface elements for listing programs. 
</p>
</div>
</div>

<div id="outline-container-sec-2-1-11" class="outline-4">
<h4 id="sec-2-1-11"><span class="section-number-4">2.1.11</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-11">
<p>
Make failed attempts to connect react more violently to that failure. Maybe have block to which you can't connect get repelled!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-12" class="outline-4">
<h4 id="sec-2-1-12"><span class="section-number-4">2.1.12</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-12">
<p>
Make drop targets for blocks larger, so that it's easier to connect them.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-13" class="outline-4">
<h4 id="sec-2-1-13"><span class="section-number-4">2.1.13</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-13">
<p>
Default type of argument should be blank.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-14" class="outline-4">
<h4 id="sec-2-1-14"><span class="section-number-4">2.1.14</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-14">
<p>
Test it on iPad !!
</p>
</div>
</div>

<div id="outline-container-sec-2-1-15" class="outline-4">
<h4 id="sec-2-1-15"><span class="section-number-4">2.1.15</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-15">
<p>
Make signature easier to open when closed
</p>
</div>
</div>

<div id="outline-container-sec-2-1-16" class="outline-4">
<h4 id="sec-2-1-16"><span class="section-number-4">2.1.16</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-16">
<p>
Move example block to next line, and add the word "For" in front so it reads "For example&#x2026;"
</p>
</div>
</div>

<div id="outline-container-sec-2-1-17" class="outline-4">
<h4 id="sec-2-1-17"><span class="section-number-4">2.1.17</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-17">
<p>
Pull latest version of Blockly
</p>
</div>
</div>

<div id="outline-container-sec-2-1-18" class="outline-4">
<h4 id="sec-2-1-18"><span class="section-number-4">2.1.18</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-1-18">
<p>
Provide support for undoing any action !!
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Low Priority <code>[0/38]</code></h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Switch to rounded rectangles. Merge this with notch shape
</p>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Change unknown color to rainbow gradient.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Move the button to open function editing dialog to the signature
</p>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Make it possible to define a value by right-clicking, saying "Name a value" (Inside functions)
</p>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Every time there is a bug, set it up to send me an email.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Inside function definition dialog, you should be able to drag a name and type into the signature to add an argument.
</p>
</div>
</div>
