TODO.org
*** TODO
Have flyout automatically refresh when I switch tabs, so that I get most up to date set of blocks.
*** TODO
Disable copying of argument blocks from one function to another. (Actually just allow, and throw error if you use an undefined variable)
*** TODO
See about having function body not just floating in space. (Don't worry about this, just throw an error if they try to run and there are multiple expressions that could be the body)
*** TODO
Build up support for vertical layouts, and convert 'if' and 'cond' to use vertical layouts.
*** TODO
Remove dependency on jQuery. Not necessarily worth the hassle, it's also only used in testing.
*** TODO
Start getting compiled mode to work.
*** TODO
Color toolbar items, according to type.
*** TODO
Figure out why drawers get confused sometimes. 
*** TODO
Rename 'unknown' to 'misc'. 
*** TODO
In funtion creation dialog, arguments names should be colored according to their type. Same with function name. 
*** TODO
Ordering for evaluation of multiple expressions in main workspace.
*** TODO
Figure out how to handle unfinished function definitions
*** TODO
Make pasting happen at cursor, not just at location of copy
*** TODO
Use DragLists to handle re-ordering arguments
*** TODO
Put 'example' block in forms
*** TODO
Figure out interface for removing/changing values
*** TODO
Require at least one argument for functions
*** TODO
Make purpose statement area much larger (input -> textarea)
*** TODO
Have individual items in the function definition dialog turn green when valid, and red otherwise, with localized error messages
*** TODO
Unify tooltips to have consistent styling
*** TODO
Unify tooltips to also use the same mechanism everywhere (not the case currently), so that I could switch to a message bar if desired
*** TODO
Provide some sort of feedback when you run tests, and there are none
*** TODO
Have results be shown as blocks
*** TODO
Figure out how to serialize everything
*** TODO
Add a 'list' category
*** TODO
See if we need 'unknown' after that
*** TODO
Add support for evaluating expressions within the body (have students provide values for the arguments / or just disallow this)
*** TODO
Have the signature return when you let go of the block you are holding
*** TODO
Have the signature not part of the canvas, so you can't drag things onto it.
*** TODO
Give name and purpose textfield/area in funDefDialog each a full line
*** TODO
Precede each line in FunDefDialog with label in bold. ("Name:", "Purpose:", "Domain:", "Range:")
*** TODO
Fix number validation for blocks

