todo.html

<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
Have flyout automatically refresh when I switch tabs, so that I get most up to date set of blocks.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-8" class="outline-4">
<h4 id="sec-2-2-8"><span class="section-number-4">2.2.8</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
Disable copying of argument blocks from one function to another. (Actually just allow, and throw error if you use an undefined variable)
</p>
</div>
</div>

<div id="outline-container-sec-2-2-9" class="outline-4">
<h4 id="sec-2-2-9"><span class="section-number-4">2.2.9</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
See about having function body not just floating in space. (Don't worry about this, just throw an error if they try to run and there are multiple expressions that could be the body)
</p>
</div>
</div>

<div id="outline-container-sec-2-2-10" class="outline-4">
<h4 id="sec-2-2-10"><span class="section-number-4">2.2.10</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
Build up support for vertical layouts, and convert 'if' and 'cond' to use vertical layouts.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-11" class="outline-4">
<h4 id="sec-2-2-11"><span class="section-number-4">2.2.11</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-11">
<p>
Remove dependency on jQuery. Not necessarily worth the hassle, it's also only used in testing.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-12" class="outline-4">
<h4 id="sec-2-2-12"><span class="section-number-4">2.2.12</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-12">
<p>
Start getting compiled mode to work.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-13" class="outline-4">
<h4 id="sec-2-2-13"><span class="section-number-4">2.2.13</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-13">
<p>
Color toolbar items, according to type.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-14" class="outline-4">
<h4 id="sec-2-2-14"><span class="section-number-4">2.2.14</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-14">
<p>
Figure out why drawers get confused sometimes. 
</p>
</div>
</div>

<div id="outline-container-sec-2-2-15" class="outline-4">
<h4 id="sec-2-2-15"><span class="section-number-4">2.2.15</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-15">
<p>
Rename 'unknown' to 'misc'. 
</p>
</div>
</div>

<div id="outline-container-sec-2-2-16" class="outline-4">
<h4 id="sec-2-2-16"><span class="section-number-4">2.2.16</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-16">
<p>
In funtion creation dialog, arguments names should be colored according to their type. Same with function name. 
</p>
</div>
</div>

<div id="outline-container-sec-2-2-17" class="outline-4">
<h4 id="sec-2-2-17"><span class="section-number-4">2.2.17</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-17">
<p>
Ordering for evaluation of multiple expressions in main workspace.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-18" class="outline-4">
<h4 id="sec-2-2-18"><span class="section-number-4">2.2.18</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-18">
<p>
Figure out how to handle unfinished function definitions
</p>
</div>
</div>

<div id="outline-container-sec-2-2-19" class="outline-4">
<h4 id="sec-2-2-19"><span class="section-number-4">2.2.19</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-19">
<p>
Make pasting happen at cursor, not just at location of copy
</p>
</div>
</div>

<div id="outline-container-sec-2-2-20" class="outline-4">
<h4 id="sec-2-2-20"><span class="section-number-4">2.2.20</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-20">
<p>
Use DragLists to handle re-ordering arguments
</p>
</div>
</div>

<div id="outline-container-sec-2-2-21" class="outline-4">
<h4 id="sec-2-2-21"><span class="section-number-4">2.2.21</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-21">
<p>
Put 'example' block in forms
</p>
</div>
</div>

<div id="outline-container-sec-2-2-22" class="outline-4">
<h4 id="sec-2-2-22"><span class="section-number-4">2.2.22</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-22">
<p>
Figure out interface for removing/changing values
</p>
</div>
</div>

<div id="outline-container-sec-2-2-23" class="outline-4">
<h4 id="sec-2-2-23"><span class="section-number-4">2.2.23</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-23">
<p>
Require at least one argument for functions
</p>
</div>
</div>

<div id="outline-container-sec-2-2-24" class="outline-4">
<h4 id="sec-2-2-24"><span class="section-number-4">2.2.24</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-24">
<p>
Make purpose statement area much larger (input -&gt; textarea)
</p>
</div>
</div>

<div id="outline-container-sec-2-2-25" class="outline-4">
<h4 id="sec-2-2-25"><span class="section-number-4">2.2.25</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-25">
<p>
Have individual items in the function definition dialog turn green when valid, and red otherwise, with localized error messages
</p>
</div>
</div>

<div id="outline-container-sec-2-2-26" class="outline-4">
<h4 id="sec-2-2-26"><span class="section-number-4">2.2.26</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-26">
<p>
Unify tooltips to have consistent styling
</p>
</div>
</div>

<div id="outline-container-sec-2-2-27" class="outline-4">
<h4 id="sec-2-2-27"><span class="section-number-4">2.2.27</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-27">
<p>
Unify tooltips to also use the same mechanism everywhere (not the case currently), so that I could switch to a message bar if desired
</p>
</div>
</div>

<div id="outline-container-sec-2-2-28" class="outline-4">
<h4 id="sec-2-2-28"><span class="section-number-4">2.2.28</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-28">
<p>
Provide some sort of feedback when you run tests, and there are none
</p>
</div>
</div>

<div id="outline-container-sec-2-2-29" class="outline-4">
<h4 id="sec-2-2-29"><span class="section-number-4">2.2.29</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-29">
<p>
Have results be shown as blocks
</p>
</div>
</div>

<div id="outline-container-sec-2-2-30" class="outline-4">
<h4 id="sec-2-2-30"><span class="section-number-4">2.2.30</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-30">
<p>
Figure out how to serialize everything
</p>
</div>
</div>

<div id="outline-container-sec-2-2-31" class="outline-4">
<h4 id="sec-2-2-31"><span class="section-number-4">2.2.31</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-31">
<p>
Add a 'list' category
</p>
</div>
</div>

<div id="outline-container-sec-2-2-32" class="outline-4">
<h4 id="sec-2-2-32"><span class="section-number-4">2.2.32</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-32">
<p>
See if we need 'unknown' after that
</p>
</div>
</div>

<div id="outline-container-sec-2-2-33" class="outline-4">
<h4 id="sec-2-2-33"><span class="section-number-4">2.2.33</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-33">
<p>
Add support for evaluating expressions within the body (have students provide values for the arguments / or just disallow this)
</p>
</div>
</div>

<div id="outline-container-sec-2-2-34" class="outline-4">
<h4 id="sec-2-2-34"><span class="section-number-4">2.2.34</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-34">
<p>
Have the signature return when you let go of the block you are holding
</p>
</div>
</div>

<div id="outline-container-sec-2-2-35" class="outline-4">
<h4 id="sec-2-2-35"><span class="section-number-4">2.2.35</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-35">
<p>
Have the signature not part of the canvas, so you can't drag things onto it.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-36" class="outline-4">
<h4 id="sec-2-2-36"><span class="section-number-4">2.2.36</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-36">
<p>
Give name and purpose textfield/area in funDefDialog each a full line
</p>
</div>
</div>

<div id="outline-container-sec-2-2-37" class="outline-4">
<h4 id="sec-2-2-37"><span class="section-number-4">2.2.37</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-37">
<p>
Precede each line in FunDefDialog with label in bold. ("Name:", "Purpose:", "Domain:", "Range:")
</p>
</div>
</div>

<div id="outline-container-sec-2-2-38" class="outline-4">
<h4 id="sec-2-2-38"><span class="section-number-4">2.2.38</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-2-2-38">
<p>
Fix number validation for blocks
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Spencer Gordon</p>
<p class="date">Created: 2013-10-27 Sun 15:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
